var rule = {
    title:'麻衣呀呼',
    host:'https://www.mayiyahu.com/',
    url:'/s/id-fyclassfyfilter/',
    //url:'/fyclass',     //网站的分类页面链接
    //class_url:'s/id-a.html&s/id-b.html&/s/id-c.html&/s/id-d.html',    //静态分类标识拼接
   // homeUrl:'/',       //网站的首页链接,用于分类获取和推荐获取
    filterable:1,//是否启用分类筛选,
    filter_url:'{{fl.area}}{{fl.by}}{{fl.class}}/page/fypage{{fl.year}}',
    filter:{
        "1":[{"key":"class","name":"类型","value":[{"n":"全部","v":"1"},{"n":"动作片","v":"25"},{"n":"喜剧片","v":"26"},{"n":"爱情片","v":"27"},{"n":"科幻片","v":"28"},{"n":"恐怖片","v":"29"},{"n":"剧情片","v":"30"},{"n":"战争片","v":"31"},{"n":"纪录片","v":"32"},,{"n":"悬疑片","v":"33"},{"n":"犯罪片","v":"34"},{"n":"冒险片","v":"35"},{"n":"动画片","v":"36"},{"n":"惊悚片","v":"37"},{"n":"奇幻片","v":"38"},{"n":"理论片","v":"39"}]},
             {"key":"area","name":"地区","value":[{"n":"全部","v":"1"},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"美国","v":"美国"},{"n":"韩国","v":"韩国"},{"n":"日本","v":"日本"},{"n":"法国","v":"法国"},{"n":"英国","v":"英国"},{"n":"德国","v":"德国"},{"n":"泰国","v":"泰国"},{"n":"印度","v":"印度"},{"n":"意大利","v":"意大利"},{"n":"西班牙","v":"西班牙"},{"n":"加拿大","v":"加拿大"},{"n":"其他","v":"其他"}]},
             {"key":"year","name":"年代","value":[{"n":"全部","v":"1"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]},
            {"key":"by","name":"排序","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hits"},{"n":"评分","v":"score"}]}],
        "2":[{"key":"class","name":"类型","value":[{"n":"全部","v":"2"},{"n":"国产剧","v":"42"},{"n":"欧美剧","v":"45"},{"n":"日韩剧","v":"47"},{"n":"港台剧","v":"49"},{"n":"泰剧","v":"51"},{"n":"海外剧","v":"52"}]},
             {"key":"area","name":"地区","value":[{"n":"全部","v":"2"},{"n":"内地","v":"内地"},{"n":"香港","v":"香港"},{"n":"美国","v":"美国"},{"n":"韩国","v":"韩国"},{"n":"日本","v":"日本"},{"n":"英国","v":"英国"},{"n":"泰国","v":"泰国"},{"n":"新加坡","v":"新加坡"},{"n":"其他","v":"其他"}]},
             {"key":"year","name":"年代","value":[{"n":"全部","v":"2"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]},
            {"key":"by","name":"排序","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hits"},{"n":"评分","v":"score"}]}],
        "3":[{"key":"class","name":"类型","value":[{"n":"全部","v":"3"},{"n":"大陆综艺","v":"20"},{"n":"日韩综艺","v":"21"},{"n":"港台综艺","v":"22"},{"n":"欧美综艺","v":"23"}]},
             {"key":"area","name":"地区","value":[{"n":"全部","v":"3"},{"n":"内地","v":"内地"},{"n":"港台","v":"港台"},{"n":"日韩","v":"日韩"},{"n":"欧美","v":"欧美"}]},
             {"key":"year","name":"年代","value":[{"n":"全部","v":"3"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]},
            {"key":"by","name":"排序","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hits"},{"n":"评分","v":"score"}]}],
        "4":[{"key":"class","name":"类型","value":[{"n":"全部","v":"4"},{"n":"国产动漫","v":"29"},{"n":"日韩动漫","v":"32"},{"n":"欧美动漫","v":"34"}]},
             {"key":"area","name":"地区","value":[{"n":"全部","v":"4"},{"n":"国产","v":"国产"},{"n":"日韩","v":"日韩"},{"n":"欧美","v":"欧美"},{"n":"其他","v":"其他"}]},
             {"key":"year","name":"年代","value":[{"n":"全部","v":"4"},{"n":"2023","v":"2023"},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"2010","v":"2010"}]},
            {"key":"by","name":"排序","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hits"},{"n":"评分","v":"score"}]}]
    },
    filter_def:{
        1:{by:'1'},
        2:{by:'2'},
        3:{by:'3'},
        4:{by:'4'}
    },
    searchUrl:'/vodsearch/**----------fypage---/',
    searchable:2,//是否启用全局搜索,
	quickSearch:1,//是否启用快速搜索,
    headers:{
        'User-Agent':'UC_UA',
       // 'User-Agent':'MOBILE_UA',
     //   "Cookie": "searchneed=ok"
    },     //网站的请求头,完整支持所有的,常带ua和cookies
    class_name:'电影&电视剧&动漫&综艺',       //静态分类名称拼接
    class_url:'a&b&c&d',    //静态分类标识拼接
    play_parse:true,    // 服务器解析播放
    detailUrl:'',
    lazy:'',    // 自定义免嗅
    limit:6,    // 首页推荐显示数量
    推荐:'.modulemod;.cf.listwap&&.gcol.l;a&&title;div&&data-original;a&&href',
      // 类似海阔一级 列表;标题;图片;描述;链接;详情 其中最后一个参数选填
    一级:"js:var items=[];pdfh=jsp.pdfh;pdfa=jsp.pdfa;pd=jsp.pd;var html=request(input);var tabs=pdfa(html,'body&&.cf.listwap .gcol.l');tabs.forEach(function(it){var  pz=pdfh(it,'a.plusclk&&Text');var ps=pdfh(it,'span.packscore&&Text');var pk=pdfh(it,'.name:eq(1)&&Text');var img=pd(it,'.inlist.ec-jabj.eclazy&&div&&data-original');var timer=pdfh(it,'.&&Text');var url=pd(it,'a&&href');items.push({desc:timer+'  '+ps,title:pz,pic_url:img,url:url})});setResult(items);",
 
    // 二级可以是*,表示规则无二级,直接拿一级的链接进行嗅探
     二级:{
          title:'.detailinfo.r h1&&Text;p.hide a&&Text',  //片名;类型 时间
          img:".detailpic.l&&img&&src",
          desc:';;;.detailinfo.r p:eq(4)&&Text;.detailinfo.r p:eq(3)&&Text',  //// 演员;导演
          content:".tjuqing&&Text", //主要信息
          tabs:"ul#play",
          lists:'.videolist.cf:eq(#id)&&a',   //显示直播信号数量。gt是指直播信号数量从-1开始第几个，li是指直播信号数量总共有几个。
          list_text:'a&&Text',
          list_url:'a&&href'
         },
     搜索:'cf.listwap;a&&title;div&&data-original;a&&href',  
    }